Revit 2024 API
TableCellStyle.GetCellStyleOverrideOptions Method
 Gets cell style override options of this cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public TableCellStyleOverrideOptions GetCellStyleOverrideOptions()
Visual Basic
Public Function GetCellStyleOverrideOptions As TableCellStyleOverrideOptions
Visual C++
public:
TableCellStyleOverrideOptions^ GetCellStyleOverrideOptions()
See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace